In [17]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np


database_name = 'scooters2'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"
engine = create_engine(connection_string)

In [2]:

query = '''
SELECT latitude
FROM scooters
LIMIT 5;
'''

result = engine.execute(query)

In [3]:
lat = pd.read_sql(query, con = engine)
lat.head()

    latitude
0  36.136822
1  36.191252
2  36.144752
3  36.162056
4  36.150973


- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [12]:
query= '''
SELECT SUM(CASE WHEN latitude is null THEN 1 ELSE 0 END) 
AS lat_nulls 
FROM scooters
'''

In [5]:
nulls = pd.read_sql(query, con = engine)
print(nulls)

   lat_nulls
0          0

In [18]:
query= '''
SELECT SUM(CASE WHEN chargelevel is null THEN 1 ELSE 0 END) 
AS charge_nulls 
FROM scooters
'''

In [19]:
nulls = pd.read_sql(query, con = engine)
print(nulls)

   charge_nulls
0           770

In [24]:
query= '''
SELECT MIN(startdate), MAX(startdate)

FROM trips
'''
ranges = pd.read_sql(query, con = engine)
print(ranges)

          min         max
0  2019-05-01  2019-07-31

In [25]:
query= '''
SELECT MIN(starttime), MAX(starttime)

FROM trips
'''
times = pd.read_sql(query, con = engine)
print(times)

        min              max
0  00:00:00  23:59:59.506666

In [34]:
query= '''
SELECT DISTINCT sumdgroup, sumdtype, companyname, COUNT(*)
FROM scooters
Group by sumdgroup, sumdtype, companyname
'''
groups = pd.read_sql(query, con = engine)
print(groups)

  sumdgroup  sumdtype companyname     count
0   scooter   Powered        Jump  21835098
1   scooter   Powered        Lime  16497732
2   Scooter   Powered        Spin   5559573
3   scooter   Powered        Bird  12251590
4   scooter   Powered        Lyft   9087043
5   bicycle  Standard        Lime     26529
6   Scooter   Powered        Bolt   3477198
7   Scooter   Powered      Gotcha   4679280

In [41]:
query= '''
(SELECT companyname, COUNT(*), 'scooters' as type
FROM scooters
Group by companyname)
UNION
(SELECT companyname, COUNT(*), 'trips' as type
FROM trips
Group by companyname)
ORDER BY companyname, type
'''

companies = pd.read_sql(query, con = engine)
print(companies)

      companyname     count      type
0            Bird  12251590  scooters
1            Bird    152745     trips
2            Bolt   3477198  scooters
3   Bolt Mobility     21890     trips
4          Gotcha   4679280  scooters
5          Gotcha      3315     trips
6            Jump  21835098  scooters
7            JUMP      6437     trips
8            Lime  16524261  scooters
9            Lime    225694     trips
10           Lyft   9087043  scooters
11           Lyft    120991     trips
12           Spin   5559573  scooters
13           SPIN     34450     trips